app/controllers/articles_controller.rb

  def create
    @article = Article.new(params.require(:article).permit(:title, :description))
    @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)